garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f46q24.h
extern volatile PMD4bits_t PMD4bits __at(0x066);
// bitfield macros
#define _PMD4_I2C2MD_POSN                                   0x0
#define _PMD4_I2C2MD_POSITION                               0x0
#define _PMD4_I2C2MD_SIZE                                   0x1
#define _PMD4_I2C2MD_LENGTH                                 0x1
#define _PMD4_I2C2MD_MASK                                   0x1
#define _PMD4_CLC1MD_POSN                                   0x1
#define _PMD4_CLC1MD_POSITION                               0x1
#define _PMD4_CLC1MD_SIZE                                   0x1
#define _PMD4_CLC1MD_LENGTH                                 0x1
#define _PMD4_CLC1MD_MASK                                   0x2
#define _PMD4_CLC2MD_POSN                                   0x2
#define _PMD4_CLC2MD_POSITION                               0x2
#define _PMD4_CLC2MD_SIZE                                   0x1
#define _PMD4_CLC2MD_LENGTH                                 0x1
#define _PMD4_CLC2MD_MASK                                   0x4
#define _PMD4_CLC3MD_POSN                                   0x3
#define _PMD4_CLC3MD_POSITION                               0x3
#define _PMD4_CLC3MD_SIZE                                   0x1
#define _PMD4_CLC3MD_LENGTH                                 0x1
#define _PMD4_CLC3MD_MASK                                   0x8
#define _PMD4_CLC4MD_POSN                                   0x4
#define _PMD4_CLC4MD_POSITION                               0x4
#define _PMD4_CLC4MD_SIZE                                   0x1
#define _PMD4_CLC4MD_LENGTH                                 0x1
#define _PMD4_CLC4MD_MASK                                   0x10
#define _PMD4_DMA1MD_POSN                                   0x5
#define _PMD4_DMA1MD_POSITION                               0x5
#define _PMD4_DMA1MD_SIZE                                   0x1
#define _PMD4_DMA1MD_LENGTH                                 0x1
#define _PMD4_DMA1MD_MASK                                   0x20
#define _PMD4_DMA2MD_POSN                                   0x6
#define _PMD4_DMA2MD_POSITION                               0x6
#define _PMD4_DMA2MD_SIZE                                   0x1
#define _PMD4_DMA2MD_LENGTH                                 0x1
#define _PMD4_DMA2MD_MASK                                   0x40
#define _PMD4_DMA3MD_POSN                                   0x7
#define _PMD4_DMA3MD_POSITION                               0x7
#define _PMD4_DMA3MD_SIZE                                   0x1
#define _PMD4_DMA3MD_LENGTH                                 0x1
#define _PMD4_DMA3MD_MASK                                   0x80

// Register: PMD5
#define PMD5 PMD5
extern volatile unsigned char           PMD5                __at(0x067);
#ifndef _LIB_BUILD
asm("PMD5 equ 067h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCD2MD                 :1;
        unsigned TU16AMD                :1;
        unsigned TU16BMD                :1;
        unsigned DMA4MD                 :1;
        unsigned CLC5MD                 :1;
        unsigned CLC6MD                 :1;
        unsigned CLC7MD                 :1;
        unsigned CLC8MD                 :1;
    };
} PMD5bits_t;
extern volatile PMD5bits_t PMD5bits __at(0x067);
// bitfield macros
#define _PMD5_ZCD2MD_POSN                                   0x0
#define _PMD5_ZCD2MD_POSITION                               0x0
#define _PMD5_ZCD2MD_SIZE                                   0x1
#define _PMD5_ZCD2MD_LENGTH                                 0x1
#define _PMD5_ZCD2MD_MASK                                   0x1
#define _PMD5_TU16AMD_POSN                                  0x1
#define _PMD5_TU16AMD_POSITION                              0x1
#define _PMD5_TU16AMD_SIZE                                  0x1
#define _PMD5_TU16AMD_LENGTH                                0x1
#define _PMD5_TU16AMD_MASK                                  0x2
#define _PMD5_TU16BMD_POSN                                  0x2
#define _PMD5_TU16BMD_POSITION                              0x2
#define _PMD5_TU16BMD_SIZE                                  0x1
#define _PMD5_TU16BMD_LENGTH                                0x1
#define _PMD5_TU16BMD_MASK                                  0x4
#define _PMD5_DMA4MD_POSN                                   0x3
#define _PMD5_DMA4MD_POSITION                               0x3
#define _PMD5_DMA4MD_SIZE                                   0x1
#define _PMD5_DMA4MD_LENGTH                                 0x1
#define _PMD5_DMA4MD_MASK                                   0x8
#define _PMD5_CLC5MD_POSN                                   0x4
#define _PMD5_CLC5MD_POSITION                               0x4
#define _PMD5_CLC5MD_SIZE                                   0x1
#define _PMD5_CLC5MD_LENGTH                                 0x1
#define _PMD5_CLC5MD_MASK                                   0x10
#define _PMD5_CLC6MD_POSN                                   0x5
#define _PMD5_CLC6MD_POSITION                               0x5
#define _PMD5_CLC6MD_SIZE                                   0x1
#define _PMD5_CLC6MD_LENGTH                                 0x1
#define _PMD5_CLC6MD_MASK                                   0x20
#define _PMD5_CLC7MD_POSN                                   0x6
#define _PMD5_CLC7MD_POSITION                               0x6
#define _PMD5_CLC7MD_SIZE                                   0x1
#define _PMD5_CLC7MD_LENGTH                                 0x1
#define _PMD5_CLC7MD_MASK                                   0x40
#define _PMD5_CLC8MD_POSN                                   0x7
#define _PMD5_CLC8MD_POSITION                               0x7
#define _PMD5_CLC8MD_SIZE                                   0x1
#define _PMD5_CLC8MD_LENGTH                                 0x1
#define _PMD5_CLC8MD_MASK                                   0x80

// Register: PMD6
#define PMD6 PMD6
extern volatile unsigned char           PMD6                __at(0x068);
#ifndef _LIB_BUILD
asm("PMD6 equ 068h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PORTWMD                :1;
    };
} PMD6bits_t;
extern volatile PMD6bits_t PMD6bits __at(0x068);
// bitfield macros
#define _PMD6_PORTWMD_POSN                                  0x0
#define _PMD6_PORTWMD_POSITION                              0x0
#define _PMD6_PORTWMD_SIZE                                  0x1
#define _PMD6_PORTWMD_LENGTH                                0x1
#define _PMD6_PORTWMD_MASK                                  0x1

// Register: CMOUT
#define CMOUT CMOUT
extern volatile unsigned char           CMOUT               __at(0x06F);
#ifndef _LIB_BUILD
asm("CMOUT equ 06Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MC1OUT                 :1;
        unsigned MC2OUT                 :1;
    };
} CMOUTbits_t;
extern volatile CMOUTbits_t CMOUTbits __at(0x06F);
// bitfield macros
#define _CMOUT_MC1OUT_POSN                                  0x0
#define _CMOUT_MC1OUT_POSITION                              0x0
#define _CMOUT_MC1OUT_SIZE                                  0x1
#define _CMOUT_MC1OUT_LENGTH                                0x1
#define _CMOUT_MC1OUT_MASK                                  0x1
#define _CMOUT_MC2OUT_POSN                                  0x1
#define _CMOUT_MC2OUT_POSITION                              0x1
#define _CMOUT_MC2OUT_SIZE                                  0x1
#define _CMOUT_MC2OUT_LENGTH                                0x1
#define _CMOUT_MC2OUT_MASK                                  0x2

// Register: CM1CON0
#define CM1CON0 CM1CON0
extern volatile unsigned char           CM1CON0             __at(0x070);
#ifndef _LIB_BUILD
asm("CM1CON0 equ 070h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :2;
        unsigned                        :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :1;
        unsigned HYS0                   :1;
        unsigned HYS1                   :1;
    };
    struct {
        unsigned C1SYNC                 :1;
        unsigned C1HYS                  :1;
        unsigned C1HYS1                 :1;
        unsigned                        :1;
        unsigned C1POL                  :1;
        unsigned                        :1;
        unsigned C1OUT                  :1;
        unsigned C1EN                   :1;
    };
} CM1CON0bits_t;
extern volatile CM1CON0bits_t CM1CON0bits __at(0x070);
// bitfield macros
#define _CM1CON0_SYNC_POSN                                  0x0
#define _CM1CON0_SYNC_POSITION                              0x0
#define _CM1CON0_SYNC_SIZE                                  0x1
#define _CM1CON0_SYNC_LENGTH                                0x1
#define _CM1CON0_SYNC_MASK                                  0x1
#define _CM1CON0_HYS_POSN                                   0x1
#define _CM1CON0_HYS_POSITION                               0x1
#define _CM1CON0_HYS_SIZE                                   0x2
#define _CM1CON0_HYS_LENGTH                                 0x2
#define _CM1CON0_HYS_MASK                                   0x6
#define _CM1CON0_POL_POSN                                   0x4
#define _CM1CON0_POL_POSITION                               0x4
#define _CM1CON0_POL_SIZE                                   0x1
#define _CM1CON0_POL_LENGTH                                 0x1
#define _CM1CON0_POL_MASK                                   0x10
#define _CM1CON0_OUT_POSN                                   0x6
#define _CM1CON0_OUT_POSITION                               0x6
#define _CM1CON0_OUT_SIZE                                   0x1
#define _CM1CON0_OUT_LENGTH                                 0x1
#define _CM1CON0_OUT_MASK                                   0x40
#define _CM1CON0_EN_POSN                                    0x7
#define _CM1CON0_EN_POSITION                                0x7
#define _CM1CON0_EN_SIZE                                    0x1
#define _CM1CON0_EN_LENGTH                                  0x1
#define _CM1CON0_EN_MASK                                    0x80
#define _CM1CON0_HYS0_POSN                                  0x1
#define _CM1CON0_HYS0_POSITION                              0x1
#define _CM1CON0_HYS0_SIZE                                  0x1
#define _CM1CON0_HYS0_LENGTH                                0x1
#define _CM1CON0_HYS0_MASK                                  0x2
#define _CM1CON0_HYS1_POSN                                  0x2
#define _CM1CON0_HYS1_POSITION                              0x2
#define _CM1CON0_HYS1_SIZE                                  0x1
#define _CM1CON0_HYS1_LENGTH                                0x1
#define _CM1CON0_HYS1_MASK                                  0x4
#define _CM1CON0_C1SYNC_POSN                                0x0
#define _CM1CON0_C1SYNC_POSITION                            0x0
#define _CM1CON0_C1SYNC_SIZE                                0x1
#define _CM1CON0_C1SYNC_LENGTH                              0x1
#define _CM1CON0_C1SYNC_MASK                                0x1
#define _CM1CON0_C1HYS_POSN                                 0x1
#define _CM1CON0_C1HYS_POSITION                             0x1
#define _CM1CON0_C1HYS_SIZE                                 0x1
#define _CM1CON0_C1HYS_LENGTH                               0x1
#define _CM1CON0_C1HYS_MASK                                 0x2
#define _CM1CON0_C1HYS1_POSN                                0x2
#define _CM1CON0_C1HYS1_POSITION                            0x2
#define _CM1CON0_C1HYS1_SIZE                                0x1
#define _CM1CON0_C1HYS1_LENGTH                              0x1
#define _CM1CON0_C1HYS1_MASK                                0x4
#define _CM1CON0_C1POL_POSN                                 0x4
#define _CM1CON0_C1POL_POSITION                             0x4
#define _CM1CON0_C1POL_SIZE                                 0x1
#define _CM1CON0_C1POL_LENGTH                               0x1
#define _CM1CON0_C1POL_MASK                                 0x10
#define _CM1CON0_C1OUT_POSN                                 0x6
#define _CM1CON0_C1OUT_POSITION                             0x6
#define _CM1CON0_C1OUT_SIZE                                 0x1
#define _CM1CON0_C1OUT_LENGTH                               0x1
#define _CM1CON0_C1OUT_MASK                                 0x40
#define _CM1CON0_C1EN_POSN                                  0x7
#define _CM1CON0_C1EN_POSITION                              0x7
#define _CM1CON0_C1EN_SIZE                                  0x1
#define _CM1CON0_C1EN_LENGTH                                0x1
#define _CM1CON0_C1EN_MASK                                  0x80

// Register: CM1CON1
#define CM1CON1 CM1CON1
extern volatile unsigned char           CM1CON1             __at(0x071);
#ifndef _LIB_BUILD
asm("CM1CON1 equ 071h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned SP                     :2;
        unsigned                        :3;
        unsigned RDY                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned SP0                    :1;
        unsigned SP1                    :1;
    };
    struct {
        unsigned C1INTN                 :1;
        unsigned C1INTP                 :1;
        unsigned C1SP0                  :1;
        unsigned C1SP1                  :1;
        unsigned                        :3;
        unsigned C1RDY                  :1;
    };
} CM1CON1bits_t;
extern volatile CM1CON1bits_t CM1CON1bits __at(0x071);
// bitfield macros
#define _CM1CON1_INTN_POSN                                  0x0
#define _CM1CON1_INTN_POSITION                              0x0
#define _CM1CON1_INTN_SIZE                                  0x1
#define _CM1CON1_INTN_LENGTH                                0x1
#define _CM1CON1_INTN_MASK                                  0x1
#define _CM1CON1_INTP_POSN                                  0x1
#define _CM1CON1_INTP_POSITION                              0x1
#define _CM1CON1_INTP_SIZE                                  0x1
#define _CM1CON1_INTP_LENGTH                                0x1
#define _CM1CON1_INTP_MASK                                  0x2
#define _CM1CON1_SP_POSN                                    0x2
#define _CM1CON1_SP_POSITION                                0x2
#define _CM1CON1_SP_SIZE                                    0x2
#define _CM1CON1_SP_LENGTH                                  0x2
#define _CM1CON1_SP_MASK                                    0xC
#define _CM1CON1_RDY_POSN                                   0x7
#define _CM1CON1_RDY_POSITION                               0x7
#define _CM1CON1_RDY_SIZE                                   0x1
#define _CM1CON1_RDY_LENGTH                                 0x1
#define _CM1CON1_RDY_MASK                                   0x80
#define _CM1CON1_SP0_POSN                                   0x2
#define _CM1CON1_SP0_POSITION                               0x2
#define _CM1CON1_SP0_SIZE                                   0x1
#define _CM1CON1_SP0_LENGTH                                 0x1
#define _CM1CON1_SP0_MASK                                   0x4
#define _CM1CON1_SP1_POSN                                   0x3
#define _CM1CON1_SP1_POSITION                               0x3
#define _CM1CON1_SP1_SIZE                                   0x1
#define _CM1CON1_SP1_LENGTH                                 0x1
#define _CM1CON1_SP1_MASK                                   0x8
#define _CM1CON1_C1INTN_POSN                                0x0
#define _CM1CON1_C1INTN_POSITION                            0x0
#define _CM1CON1_C1INTN_SIZE                                0x1
#define _CM1CON1_C1INTN_LENGTH                              0x1
#define _CM1CON1_C1INTN_MASK                                0x1
#define _CM1CON1_C1INTP_POSN                                0x1
#define _CM1CON1_C1INTP_POSITION                            0x1
#define _CM1CON1_C1INTP_SIZE                                0x1
#define _CM1CON1_C1INTP_LENGTH                              0x1
#define _CM1CON1_C1INTP_MASK                                0x2
#define _CM1CON1_C1SP0_POSN                                 0x2
#define _CM1CON1_C1SP0_POSITION                             0x2
#define _CM1CON1_C1SP0_SIZE                                 0x1
#define _CM1CON1_C1SP0_LENGTH                               0x1
#define _CM1CON1_C1SP0_MASK                                 0x4
#define _CM1CON1_C1SP1_POSN                                 0x3
#define _CM1CON1_C1SP1_POSITION                             0x3
#define _CM1CON1_C1SP1_SIZE                                 0x1
#define _CM1CON1_C1SP1_LENGTH                               0x1
#define _CM1CON1_C1SP1_MASK                                 0x8
#define _CM1CON1_C1RDY_POSN                                 0x7
#define _CM1CON1_C1RDY_POSITION                             0x7
#define _CM1CON1_C1RDY_SIZE                                 0x1
#define _CM1CON1_C1RDY_LENGTH                               0x1
#define _CM1CON1_C1RDY_MASK                                 0x80

