garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f46q24.h
// Register: DMAnDPTRH
#define DMAnDPTRH DMAnDPTRH
extern volatile unsigned char           DMAnDPTRH           __at(0x0EC);
#ifndef _LIB_BUILD
asm("DMAnDPTRH equ 0ECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR8                  :1;
        unsigned DPTR9                  :1;
        unsigned DPTR10                 :1;
        unsigned DPTR11                 :1;
        unsigned DPTR12                 :1;
        unsigned DPTR13                 :1;
        unsigned DPTR14                 :1;
        unsigned DPTR15                 :1;
    };
} DMAnDPTRHbits_t;
extern volatile DMAnDPTRHbits_t DMAnDPTRHbits __at(0x0EC);
// bitfield macros
#define _DMAnDPTRH_DPTR_POSN                                0x0
#define _DMAnDPTRH_DPTR_POSITION                            0x0
#define _DMAnDPTRH_DPTR_SIZE                                0x8
#define _DMAnDPTRH_DPTR_LENGTH                              0x8
#define _DMAnDPTRH_DPTR_MASK                                0xFF
#define _DMAnDPTRH_DPTR8_POSN                               0x0
#define _DMAnDPTRH_DPTR8_POSITION                           0x0
#define _DMAnDPTRH_DPTR8_SIZE                               0x1
#define _DMAnDPTRH_DPTR8_LENGTH                             0x1
#define _DMAnDPTRH_DPTR8_MASK                               0x1
#define _DMAnDPTRH_DPTR9_POSN                               0x1
#define _DMAnDPTRH_DPTR9_POSITION                           0x1
#define _DMAnDPTRH_DPTR9_SIZE                               0x1
#define _DMAnDPTRH_DPTR9_LENGTH                             0x1
#define _DMAnDPTRH_DPTR9_MASK                               0x2
#define _DMAnDPTRH_DPTR10_POSN                              0x2
#define _DMAnDPTRH_DPTR10_POSITION                          0x2
#define _DMAnDPTRH_DPTR10_SIZE                              0x1
#define _DMAnDPTRH_DPTR10_LENGTH                            0x1
#define _DMAnDPTRH_DPTR10_MASK                              0x4
#define _DMAnDPTRH_DPTR11_POSN                              0x3
#define _DMAnDPTRH_DPTR11_POSITION                          0x3
#define _DMAnDPTRH_DPTR11_SIZE                              0x1
#define _DMAnDPTRH_DPTR11_LENGTH                            0x1
#define _DMAnDPTRH_DPTR11_MASK                              0x8
#define _DMAnDPTRH_DPTR12_POSN                              0x4
#define _DMAnDPTRH_DPTR12_POSITION                          0x4
#define _DMAnDPTRH_DPTR12_SIZE                              0x1
#define _DMAnDPTRH_DPTR12_LENGTH                            0x1
#define _DMAnDPTRH_DPTR12_MASK                              0x10
#define _DMAnDPTRH_DPTR13_POSN                              0x5
#define _DMAnDPTRH_DPTR13_POSITION                          0x5
#define _DMAnDPTRH_DPTR13_SIZE                              0x1
#define _DMAnDPTRH_DPTR13_LENGTH                            0x1
#define _DMAnDPTRH_DPTR13_MASK                              0x20
#define _DMAnDPTRH_DPTR14_POSN                              0x6
#define _DMAnDPTRH_DPTR14_POSITION                          0x6
#define _DMAnDPTRH_DPTR14_SIZE                              0x1
#define _DMAnDPTRH_DPTR14_LENGTH                            0x1
#define _DMAnDPTRH_DPTR14_MASK                              0x40
#define _DMAnDPTRH_DPTR15_POSN                              0x7
#define _DMAnDPTRH_DPTR15_POSITION                          0x7
#define _DMAnDPTRH_DPTR15_SIZE                              0x1
#define _DMAnDPTRH_DPTR15_LENGTH                            0x1
#define _DMAnDPTRH_DPTR15_MASK                              0x80

// Register: DMAnDSZ
#define DMAnDSZ DMAnDSZ
extern volatile unsigned short          DMAnDSZ             __at(0x0ED);
#ifndef _LIB_BUILD
asm("DMAnDSZ equ 0EDh");
#endif

// Register: DMAnDSZL
#define DMAnDSZL DMAnDSZL
extern volatile unsigned char           DMAnDSZL            __at(0x0ED);
#ifndef _LIB_BUILD
asm("DMAnDSZL equ 0EDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSZ                    :8;
    };
    struct {
        unsigned DSZ0                   :1;
        unsigned DSZ1                   :1;
        unsigned DSZ2                   :1;
        unsigned DSZ3                   :1;
        unsigned DSZ4                   :1;
        unsigned DSZ5                   :1;
        unsigned DSZ6                   :1;
        unsigned DSZ7                   :1;
    };
} DMAnDSZLbits_t;
extern volatile DMAnDSZLbits_t DMAnDSZLbits __at(0x0ED);
// bitfield macros
#define _DMAnDSZL_DSZ_POSN                                  0x0
#define _DMAnDSZL_DSZ_POSITION                              0x0
#define _DMAnDSZL_DSZ_SIZE                                  0x8
#define _DMAnDSZL_DSZ_LENGTH                                0x8
#define _DMAnDSZL_DSZ_MASK                                  0xFF
#define _DMAnDSZL_DSZ0_POSN                                 0x0
#define _DMAnDSZL_DSZ0_POSITION                             0x0
#define _DMAnDSZL_DSZ0_SIZE                                 0x1
#define _DMAnDSZL_DSZ0_LENGTH                               0x1
#define _DMAnDSZL_DSZ0_MASK                                 0x1
#define _DMAnDSZL_DSZ1_POSN                                 0x1
#define _DMAnDSZL_DSZ1_POSITION                             0x1
#define _DMAnDSZL_DSZ1_SIZE                                 0x1
#define _DMAnDSZL_DSZ1_LENGTH                               0x1
#define _DMAnDSZL_DSZ1_MASK                                 0x2
#define _DMAnDSZL_DSZ2_POSN                                 0x2
#define _DMAnDSZL_DSZ2_POSITION                             0x2
#define _DMAnDSZL_DSZ2_SIZE                                 0x1
#define _DMAnDSZL_DSZ2_LENGTH                               0x1
#define _DMAnDSZL_DSZ2_MASK                                 0x4
#define _DMAnDSZL_DSZ3_POSN                                 0x3
#define _DMAnDSZL_DSZ3_POSITION                             0x3
#define _DMAnDSZL_DSZ3_SIZE                                 0x1
#define _DMAnDSZL_DSZ3_LENGTH                               0x1
#define _DMAnDSZL_DSZ3_MASK                                 0x8
#define _DMAnDSZL_DSZ4_POSN                                 0x4
#define _DMAnDSZL_DSZ4_POSITION                             0x4
#define _DMAnDSZL_DSZ4_SIZE                                 0x1
#define _DMAnDSZL_DSZ4_LENGTH                               0x1
#define _DMAnDSZL_DSZ4_MASK                                 0x10
#define _DMAnDSZL_DSZ5_POSN                                 0x5
#define _DMAnDSZL_DSZ5_POSITION                             0x5
#define _DMAnDSZL_DSZ5_SIZE                                 0x1
#define _DMAnDSZL_DSZ5_LENGTH                               0x1
#define _DMAnDSZL_DSZ5_MASK                                 0x20
#define _DMAnDSZL_DSZ6_POSN                                 0x6
#define _DMAnDSZL_DSZ6_POSITION                             0x6
#define _DMAnDSZL_DSZ6_SIZE                                 0x1
#define _DMAnDSZL_DSZ6_LENGTH                               0x1
#define _DMAnDSZL_DSZ6_MASK                                 0x40
#define _DMAnDSZL_DSZ7_POSN                                 0x7
#define _DMAnDSZL_DSZ7_POSITION                             0x7
#define _DMAnDSZL_DSZ7_SIZE                                 0x1
#define _DMAnDSZL_DSZ7_LENGTH                               0x1
#define _DMAnDSZL_DSZ7_MASK                                 0x80

