garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f46q24.h
// Register: ADCG1B
#define ADCG1B ADCG1B
extern volatile unsigned char           ADCG1B              __at(0x111);
#ifndef _LIB_BUILD
asm("ADCG1B equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGB0                   :1;
        unsigned CGB1                   :1;
        unsigned CGB2                   :1;
        unsigned CGB3                   :1;
        unsigned CGB4                   :1;
        unsigned CGB5                   :1;
        unsigned CGB6                   :1;
        unsigned CGB7                   :1;
    };
} ADCG1Bbits_t;
extern volatile ADCG1Bbits_t ADCG1Bbits __at(0x111);
// bitfield macros
#define _ADCG1B_CGB0_POSN                                   0x0
#define _ADCG1B_CGB0_POSITION                               0x0
#define _ADCG1B_CGB0_SIZE                                   0x1
#define _ADCG1B_CGB0_LENGTH                                 0x1
#define _ADCG1B_CGB0_MASK                                   0x1
#define _ADCG1B_CGB1_POSN                                   0x1
#define _ADCG1B_CGB1_POSITION                               0x1
#define _ADCG1B_CGB1_SIZE                                   0x1
#define _ADCG1B_CGB1_LENGTH                                 0x1
#define _ADCG1B_CGB1_MASK                                   0x2
#define _ADCG1B_CGB2_POSN                                   0x2
#define _ADCG1B_CGB2_POSITION                               0x2
#define _ADCG1B_CGB2_SIZE                                   0x1
#define _ADCG1B_CGB2_LENGTH                                 0x1
#define _ADCG1B_CGB2_MASK                                   0x4
#define _ADCG1B_CGB3_POSN                                   0x3
#define _ADCG1B_CGB3_POSITION                               0x3
#define _ADCG1B_CGB3_SIZE                                   0x1
#define _ADCG1B_CGB3_LENGTH                                 0x1
#define _ADCG1B_CGB3_MASK                                   0x8
#define _ADCG1B_CGB4_POSN                                   0x4
#define _ADCG1B_CGB4_POSITION                               0x4
#define _ADCG1B_CGB4_SIZE                                   0x1
#define _ADCG1B_CGB4_LENGTH                                 0x1
#define _ADCG1B_CGB4_MASK                                   0x10
#define _ADCG1B_CGB5_POSN                                   0x5
#define _ADCG1B_CGB5_POSITION                               0x5
#define _ADCG1B_CGB5_SIZE                                   0x1
#define _ADCG1B_CGB5_LENGTH                                 0x1
#define _ADCG1B_CGB5_MASK                                   0x20
#define _ADCG1B_CGB6_POSN                                   0x6
#define _ADCG1B_CGB6_POSITION                               0x6
#define _ADCG1B_CGB6_SIZE                                   0x1
#define _ADCG1B_CGB6_LENGTH                                 0x1
#define _ADCG1B_CGB6_MASK                                   0x40
#define _ADCG1B_CGB7_POSN                                   0x7
#define _ADCG1B_CGB7_POSITION                               0x7
#define _ADCG1B_CGB7_SIZE                                   0x1
#define _ADCG1B_CGB7_LENGTH                                 0x1
#define _ADCG1B_CGB7_MASK                                   0x80

// Register: ADCG1C
#define ADCG1C ADCG1C
extern volatile unsigned char           ADCG1C              __at(0x112);
#ifndef _LIB_BUILD
asm("ADCG1C equ 0112h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGC0                   :1;
        unsigned CGC1                   :1;
        unsigned CGC2                   :1;
    };
} ADCG1Cbits_t;
extern volatile ADCG1Cbits_t ADCG1Cbits __at(0x112);
// bitfield macros
#define _ADCG1C_CGC0_POSN                                   0x0
#define _ADCG1C_CGC0_POSITION                               0x0
#define _ADCG1C_CGC0_SIZE                                   0x1
#define _ADCG1C_CGC0_LENGTH                                 0x1
#define _ADCG1C_CGC0_MASK                                   0x1
#define _ADCG1C_CGC1_POSN                                   0x1
#define _ADCG1C_CGC1_POSITION                               0x1
#define _ADCG1C_CGC1_SIZE                                   0x1
#define _ADCG1C_CGC1_LENGTH                                 0x1
#define _ADCG1C_CGC1_MASK                                   0x2
#define _ADCG1C_CGC2_POSN                                   0x2
#define _ADCG1C_CGC2_POSITION                               0x2
#define _ADCG1C_CGC2_SIZE                                   0x1
#define _ADCG1C_CGC2_LENGTH                                 0x1
#define _ADCG1C_CGC2_MASK                                   0x4

// Register: ADCG1E
#define ADCG1E ADCG1E
extern volatile unsigned char           ADCG1E              __at(0x114);
#ifndef _LIB_BUILD
asm("ADCG1E equ 0114h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGE0                   :1;
        unsigned CGE1                   :1;
        unsigned CGE2                   :1;
    };
} ADCG1Ebits_t;
extern volatile ADCG1Ebits_t ADCG1Ebits __at(0x114);
// bitfield macros
#define _ADCG1E_CGE0_POSN                                   0x0
#define _ADCG1E_CGE0_POSITION                               0x0
#define _ADCG1E_CGE0_SIZE                                   0x1
#define _ADCG1E_CGE0_LENGTH                                 0x1
#define _ADCG1E_CGE0_MASK                                   0x1
#define _ADCG1E_CGE1_POSN                                   0x1
#define _ADCG1E_CGE1_POSITION                               0x1
#define _ADCG1E_CGE1_SIZE                                   0x1
#define _ADCG1E_CGE1_LENGTH                                 0x1
#define _ADCG1E_CGE1_MASK                                   0x2
#define _ADCG1E_CGE2_POSN                                   0x2
#define _ADCG1E_CGE2_POSITION                               0x2
#define _ADCG1E_CGE2_SIZE                                   0x1
#define _ADCG1E_CGE2_LENGTH                                 0x1
#define _ADCG1E_CGE2_MASK                                   0x4

