garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f46q24.h
extern volatile I2C2BTObits_t I2C2BTObits __at(0x2B2);
// bitfield macros
#define _I2C2BTO_TOTIME_POSN                                0x0
#define _I2C2BTO_TOTIME_POSITION                            0x0
#define _I2C2BTO_TOTIME_SIZE                                0x6
#define _I2C2BTO_TOTIME_LENGTH                              0x6
#define _I2C2BTO_TOTIME_MASK                                0x3F
#define _I2C2BTO_TOBY32_POSN                                0x6
#define _I2C2BTO_TOBY32_POSITION                            0x6
#define _I2C2BTO_TOBY32_SIZE                                0x1
#define _I2C2BTO_TOBY32_LENGTH                              0x1
#define _I2C2BTO_TOBY32_MASK                                0x40
#define _I2C2BTO_TOREC_POSN                                 0x7
#define _I2C2BTO_TOREC_POSITION                             0x7
#define _I2C2BTO_TOREC_SIZE                                 0x1
#define _I2C2BTO_TOREC_LENGTH                               0x1
#define _I2C2BTO_TOREC_MASK                                 0x80
#define _I2C2BTO_TOTIME0_POSN                               0x0
#define _I2C2BTO_TOTIME0_POSITION                           0x0
#define _I2C2BTO_TOTIME0_SIZE                               0x1
#define _I2C2BTO_TOTIME0_LENGTH                             0x1
#define _I2C2BTO_TOTIME0_MASK                               0x1
#define _I2C2BTO_TOTIME1_POSN                               0x1
#define _I2C2BTO_TOTIME1_POSITION                           0x1
#define _I2C2BTO_TOTIME1_SIZE                               0x1
#define _I2C2BTO_TOTIME1_LENGTH                             0x1
#define _I2C2BTO_TOTIME1_MASK                               0x2
#define _I2C2BTO_TOTIME2_POSN                               0x2
#define _I2C2BTO_TOTIME2_POSITION                           0x2
#define _I2C2BTO_TOTIME2_SIZE                               0x1
#define _I2C2BTO_TOTIME2_LENGTH                             0x1
#define _I2C2BTO_TOTIME2_MASK                               0x4
#define _I2C2BTO_TOTIME3_POSN                               0x3
#define _I2C2BTO_TOTIME3_POSITION                           0x3
#define _I2C2BTO_TOTIME3_SIZE                               0x1
#define _I2C2BTO_TOTIME3_LENGTH                             0x1
#define _I2C2BTO_TOTIME3_MASK                               0x8
#define _I2C2BTO_TOTIME4_POSN                               0x4
#define _I2C2BTO_TOTIME4_POSITION                           0x4
#define _I2C2BTO_TOTIME4_SIZE                               0x1
#define _I2C2BTO_TOTIME4_LENGTH                             0x1
#define _I2C2BTO_TOTIME4_MASK                               0x10
#define _I2C2BTO_TOTIME5_POSN                               0x5
#define _I2C2BTO_TOTIME5_POSITION                           0x5
#define _I2C2BTO_TOTIME5_SIZE                               0x1
#define _I2C2BTO_TOTIME5_LENGTH                             0x1
#define _I2C2BTO_TOTIME5_MASK                               0x20

// Register: I2C2BAUD
#define I2C2BAUD I2C2BAUD
extern volatile unsigned char           I2C2BAUD            __at(0x2B3);
#ifndef _LIB_BUILD
asm("I2C2BAUD equ 02B3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BAUD                   :8;
    };
} I2C2BAUDbits_t;
extern volatile I2C2BAUDbits_t I2C2BAUDbits __at(0x2B3);
// bitfield macros
#define _I2C2BAUD_BAUD_POSN                                 0x0
#define _I2C2BAUD_BAUD_POSITION                             0x0
#define _I2C2BAUD_BAUD_SIZE                                 0x8
#define _I2C2BAUD_BAUD_LENGTH                               0x8
#define _I2C2BAUD_BAUD_MASK                                 0xFF

// Register: I2C2CLK
#define I2C2CLK I2C2CLK
extern volatile unsigned char           I2C2CLK             __at(0x2B4);
#ifndef _LIB_BUILD
asm("I2C2CLK equ 02B4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned I2CCLK                 :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
    };
    struct {
        unsigned I2CCLK0                :1;
        unsigned I2CCLK1                :1;
        unsigned I2CCLK2                :1;
        unsigned I2CCLK3                :1;
        unsigned I2CCLK4                :1;
    };
} I2C2CLKbits_t;
extern volatile I2C2CLKbits_t I2C2CLKbits __at(0x2B4);
// bitfield macros
#define _I2C2CLK_CLK_POSN                                   0x0
#define _I2C2CLK_CLK_POSITION                               0x0
#define _I2C2CLK_CLK_SIZE                                   0x8
#define _I2C2CLK_CLK_LENGTH                                 0x8
#define _I2C2CLK_CLK_MASK                                   0xFF
#define _I2C2CLK_I2CCLK_POSN                                0x0
#define _I2C2CLK_I2CCLK_POSITION                            0x0
#define _I2C2CLK_I2CCLK_SIZE                                0x8
#define _I2C2CLK_I2CCLK_LENGTH                              0x8
#define _I2C2CLK_I2CCLK_MASK                                0xFF
#define _I2C2CLK_CLK0_POSN                                  0x0
#define _I2C2CLK_CLK0_POSITION                              0x0
#define _I2C2CLK_CLK0_SIZE                                  0x1
#define _I2C2CLK_CLK0_LENGTH                                0x1
#define _I2C2CLK_CLK0_MASK                                  0x1
#define _I2C2CLK_CLK1_POSN                                  0x1
#define _I2C2CLK_CLK1_POSITION                              0x1
#define _I2C2CLK_CLK1_SIZE                                  0x1
#define _I2C2CLK_CLK1_LENGTH                                0x1
#define _I2C2CLK_CLK1_MASK                                  0x2
#define _I2C2CLK_CLK2_POSN                                  0x2
#define _I2C2CLK_CLK2_POSITION                              0x2
#define _I2C2CLK_CLK2_SIZE                                  0x1
#define _I2C2CLK_CLK2_LENGTH                                0x1
#define _I2C2CLK_CLK2_MASK                                  0x4
#define _I2C2CLK_CLK3_POSN                                  0x3
#define _I2C2CLK_CLK3_POSITION                              0x3
#define _I2C2CLK_CLK3_SIZE                                  0x1
#define _I2C2CLK_CLK3_LENGTH                                0x1
#define _I2C2CLK_CLK3_MASK                                  0x8
#define _I2C2CLK_CLK4_POSN                                  0x4
#define _I2C2CLK_CLK4_POSITION                              0x4
#define _I2C2CLK_CLK4_SIZE                                  0x1
#define _I2C2CLK_CLK4_LENGTH                                0x1
#define _I2C2CLK_CLK4_MASK                                  0x10
#define _I2C2CLK_I2CCLK0_POSN                               0x0
#define _I2C2CLK_I2CCLK0_POSITION                           0x0
#define _I2C2CLK_I2CCLK0_SIZE                               0x1
#define _I2C2CLK_I2CCLK0_LENGTH                             0x1
#define _I2C2CLK_I2CCLK0_MASK                               0x1
#define _I2C2CLK_I2CCLK1_POSN                               0x1
#define _I2C2CLK_I2CCLK1_POSITION                           0x1
#define _I2C2CLK_I2CCLK1_SIZE                               0x1
#define _I2C2CLK_I2CCLK1_LENGTH                             0x1
#define _I2C2CLK_I2CCLK1_MASK                               0x2
#define _I2C2CLK_I2CCLK2_POSN                               0x2
#define _I2C2CLK_I2CCLK2_POSITION                           0x2
#define _I2C2CLK_I2CCLK2_SIZE                               0x1
#define _I2C2CLK_I2CCLK2_LENGTH                             0x1
#define _I2C2CLK_I2CCLK2_MASK                               0x4
#define _I2C2CLK_I2CCLK3_POSN                               0x3
#define _I2C2CLK_I2CCLK3_POSITION                           0x3
#define _I2C2CLK_I2CCLK3_SIZE                               0x1
#define _I2C2CLK_I2CCLK3_LENGTH                             0x1
#define _I2C2CLK_I2CCLK3_MASK                               0x8
#define _I2C2CLK_I2CCLK4_POSN                               0x4
#define _I2C2CLK_I2CCLK4_POSITION                           0x4
#define _I2C2CLK_I2CCLK4_SIZE                               0x1
#define _I2C2CLK_I2CCLK4_LENGTH                             0x1
#define _I2C2CLK_I2CCLK4_MASK                               0x10

// Register: I2C2BTOC
#define I2C2BTOC I2C2BTOC
extern volatile unsigned char           I2C2BTOC            __at(0x2B5);
#ifndef _LIB_BUILD
asm("I2C2BTOC equ 02B5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTOC                   :8;
    };
    struct {
        unsigned I2CBTOC                :8;
    };
    struct {
        unsigned BTOC0                  :1;
        unsigned BTOC1                  :1;
        unsigned BTOC2                  :1;
        unsigned BTOC3                  :1;
    };
    struct {
        unsigned I2CBTOC0               :1;
        unsigned I2CBTOC1               :1;
        unsigned I2CBTOC2               :1;
        unsigned I2CBTOC3               :1;
    };
} I2C2BTOCbits_t;
