garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f46q24.h
// Register: TU16APS
#define TU16APS TU16APS
extern volatile unsigned char           TU16APS             __at(0x3A0);
#ifndef _LIB_BUILD
asm("TU16APS equ 03A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PS                     :8;
    };
    struct {
        unsigned PS0                    :1;
        unsigned PS1                    :1;
        unsigned PS2                    :1;
        unsigned PS3                    :1;
        unsigned PS4                    :1;
        unsigned PS5                    :1;
        unsigned PS6                    :1;
        unsigned PS7                    :1;
    };
    struct {
        unsigned TU16APS0               :1;
        unsigned TU16APS1               :1;
        unsigned TU16APS2               :1;
        unsigned TU16APS3               :1;
        unsigned TU16APS4               :1;
        unsigned TU16APS5               :1;
        unsigned TU16APS6               :1;
        unsigned TU16APS7               :1;
    };
    struct {
        unsigned TU16APS                :8;
    };
} TU16APSbits_t;
extern volatile TU16APSbits_t TU16APSbits __at(0x3A0);
// bitfield macros
#define _TU16APS_PS_POSN                                    0x0
#define _TU16APS_PS_POSITION                                0x0
#define _TU16APS_PS_SIZE                                    0x8
#define _TU16APS_PS_LENGTH                                  0x8
#define _TU16APS_PS_MASK                                    0xFF
#define _TU16APS_PS0_POSN                                   0x0
#define _TU16APS_PS0_POSITION                               0x0
#define _TU16APS_PS0_SIZE                                   0x1
#define _TU16APS_PS0_LENGTH                                 0x1
#define _TU16APS_PS0_MASK                                   0x1
#define _TU16APS_PS1_POSN                                   0x1
#define _TU16APS_PS1_POSITION                               0x1
#define _TU16APS_PS1_SIZE                                   0x1
#define _TU16APS_PS1_LENGTH                                 0x1
#define _TU16APS_PS1_MASK                                   0x2
#define _TU16APS_PS2_POSN                                   0x2
#define _TU16APS_PS2_POSITION                               0x2
#define _TU16APS_PS2_SIZE                                   0x1
#define _TU16APS_PS2_LENGTH                                 0x1
#define _TU16APS_PS2_MASK                                   0x4
#define _TU16APS_PS3_POSN                                   0x3
#define _TU16APS_PS3_POSITION                               0x3
#define _TU16APS_PS3_SIZE                                   0x1
#define _TU16APS_PS3_LENGTH                                 0x1
#define _TU16APS_PS3_MASK                                   0x8
#define _TU16APS_PS4_POSN                                   0x4
#define _TU16APS_PS4_POSITION                               0x4
#define _TU16APS_PS4_SIZE                                   0x1
#define _TU16APS_PS4_LENGTH                                 0x1
#define _TU16APS_PS4_MASK                                   0x10
#define _TU16APS_PS5_POSN                                   0x5
#define _TU16APS_PS5_POSITION                               0x5
#define _TU16APS_PS5_SIZE                                   0x1
#define _TU16APS_PS5_LENGTH                                 0x1
#define _TU16APS_PS5_MASK                                   0x20
#define _TU16APS_PS6_POSN                                   0x6
#define _TU16APS_PS6_POSITION                               0x6
#define _TU16APS_PS6_SIZE                                   0x1
#define _TU16APS_PS6_LENGTH                                 0x1
#define _TU16APS_PS6_MASK                                   0x40
#define _TU16APS_PS7_POSN                                   0x7
#define _TU16APS_PS7_POSITION                               0x7
#define _TU16APS_PS7_SIZE                                   0x1
#define _TU16APS_PS7_LENGTH                                 0x1
#define _TU16APS_PS7_MASK                                   0x80
#define _TU16APS_TU16APS0_POSN                              0x0
#define _TU16APS_TU16APS0_POSITION                          0x0
#define _TU16APS_TU16APS0_SIZE                              0x1
#define _TU16APS_TU16APS0_LENGTH                            0x1
#define _TU16APS_TU16APS0_MASK                              0x1
#define _TU16APS_TU16APS1_POSN                              0x1
#define _TU16APS_TU16APS1_POSITION                          0x1
#define _TU16APS_TU16APS1_SIZE                              0x1
#define _TU16APS_TU16APS1_LENGTH                            0x1
#define _TU16APS_TU16APS1_MASK                              0x2
#define _TU16APS_TU16APS2_POSN                              0x2
#define _TU16APS_TU16APS2_POSITION                          0x2
#define _TU16APS_TU16APS2_SIZE                              0x1
#define _TU16APS_TU16APS2_LENGTH                            0x1
#define _TU16APS_TU16APS2_MASK                              0x4
#define _TU16APS_TU16APS3_POSN                              0x3
#define _TU16APS_TU16APS3_POSITION                          0x3
#define _TU16APS_TU16APS3_SIZE                              0x1
#define _TU16APS_TU16APS3_LENGTH                            0x1
#define _TU16APS_TU16APS3_MASK                              0x8
#define _TU16APS_TU16APS4_POSN                              0x4
#define _TU16APS_TU16APS4_POSITION                          0x4
#define _TU16APS_TU16APS4_SIZE                              0x1
#define _TU16APS_TU16APS4_LENGTH                            0x1
#define _TU16APS_TU16APS4_MASK                              0x10
#define _TU16APS_TU16APS5_POSN                              0x5
#define _TU16APS_TU16APS5_POSITION                          0x5
#define _TU16APS_TU16APS5_SIZE                              0x1
#define _TU16APS_TU16APS5_LENGTH                            0x1
#define _TU16APS_TU16APS5_MASK                              0x20
#define _TU16APS_TU16APS6_POSN                              0x6
#define _TU16APS_TU16APS6_POSITION                          0x6
#define _TU16APS_TU16APS6_SIZE                              0x1
#define _TU16APS_TU16APS6_LENGTH                            0x1
#define _TU16APS_TU16APS6_MASK                              0x40
#define _TU16APS_TU16APS7_POSN                              0x7
#define _TU16APS_TU16APS7_POSITION                          0x7
#define _TU16APS_TU16APS7_SIZE                              0x1
#define _TU16APS_TU16APS7_LENGTH                            0x1
#define _TU16APS_TU16APS7_MASK                              0x80
#define _TU16APS_TU16APS_POSN                               0x0
#define _TU16APS_TU16APS_POSITION                           0x0
#define _TU16APS_TU16APS_SIZE                               0x8
#define _TU16APS_TU16APS_LENGTH                             0x8
#define _TU16APS_TU16APS_MASK                               0xFF

// Register: TU16ATMR
#define TU16ATMR TU16ATMR
extern volatile unsigned long           TU16ATMR            __at(0x3A1);
#ifndef _LIB_BUILD
asm("TU16ATMR equ 03A1h");
#endif
// aliases
extern volatile unsigned long           TU16ACR             __at(0x3A1);
#ifndef _LIB_BUILD
asm("TU16ACR equ 03A1h");
#endif

// Register: TU16ATMRL
#define TU16ATMRL TU16ATMRL
extern volatile unsigned char           TU16ATMRL           __at(0x3A1);
#ifndef _LIB_BUILD
asm("TU16ATMRL equ 03A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMRL                   :8;
    };
    struct {
        unsigned TMRL0                  :1;
        unsigned TMRL1                  :1;
        unsigned TMRL2                  :1;
        unsigned TMRL3                  :1;
        unsigned TMRL4                  :1;
        unsigned TMRL5                  :1;
        unsigned TMRL6                  :1;
        unsigned TMRL7                  :1;
    };
    struct {
        unsigned TU16ATMRL0             :1;
        unsigned TU16ATMRL1             :1;
        unsigned TU16ATMRL2             :1;
        unsigned TU16ATMRL3             :1;
        unsigned TU16ATMRL4             :1;
        unsigned TU16ATMRL5             :1;
        unsigned TU16ATMRL6             :1;
        unsigned TU16ATMRL7             :1;
    };
    struct {
        unsigned TU16ATMR0              :1;
        unsigned TU16ATMR1              :1;
        unsigned TU16ATMR2              :1;
        unsigned TU16ATMR3              :1;
        unsigned TU16ATMR4              :1;
        unsigned TU16ATMR5              :1;
        unsigned TU16ATMR6              :1;
        unsigned TU16ATMR7              :1;
    };
} TU16ATMRLbits_t;
extern volatile TU16ATMRLbits_t TU16ATMRLbits __at(0x3A1);
// bitfield macros
#define _TU16ATMRL_TMRL_POSN                                0x0
#define _TU16ATMRL_TMRL_POSITION                            0x0
#define _TU16ATMRL_TMRL_SIZE                                0x8
#define _TU16ATMRL_TMRL_LENGTH                              0x8
#define _TU16ATMRL_TMRL_MASK                                0xFF
#define _TU16ATMRL_TMRL0_POSN                               0x0
#define _TU16ATMRL_TMRL0_POSITION                           0x0
#define _TU16ATMRL_TMRL0_SIZE                               0x1
#define _TU16ATMRL_TMRL0_LENGTH                             0x1
#define _TU16ATMRL_TMRL0_MASK                               0x1
#define _TU16ATMRL_TMRL1_POSN                               0x1
#define _TU16ATMRL_TMRL1_POSITION                           0x1
#define _TU16ATMRL_TMRL1_SIZE                               0x1
#define _TU16ATMRL_TMRL1_LENGTH                             0x1
#define _TU16ATMRL_TMRL1_MASK                               0x2
#define _TU16ATMRL_TMRL2_POSN                               0x2
#define _TU16ATMRL_TMRL2_POSITION                           0x2
#define _TU16ATMRL_TMRL2_SIZE                               0x1
#define _TU16ATMRL_TMRL2_LENGTH                             0x1
#define _TU16ATMRL_TMRL2_MASK                               0x4
#define _TU16ATMRL_TMRL3_POSN                               0x3
#define _TU16ATMRL_TMRL3_POSITION                           0x3
#define _TU16ATMRL_TMRL3_SIZE                               0x1
#define _TU16ATMRL_TMRL3_LENGTH                             0x1
#define _TU16ATMRL_TMRL3_MASK                               0x8
#define _TU16ATMRL_TMRL4_POSN                               0x4
#define _TU16ATMRL_TMRL4_POSITION                           0x4
#define _TU16ATMRL_TMRL4_SIZE                               0x1
#define _TU16ATMRL_TMRL4_LENGTH                             0x1
#define _TU16ATMRL_TMRL4_MASK                               0x10
#define _TU16ATMRL_TMRL5_POSN                               0x5
#define _TU16ATMRL_TMRL5_POSITION                           0x5
#define _TU16ATMRL_TMRL5_SIZE                               0x1
#define _TU16ATMRL_TMRL5_LENGTH                             0x1
#define _TU16ATMRL_TMRL5_MASK                               0x20
#define _TU16ATMRL_TMRL6_POSN                               0x6
#define _TU16ATMRL_TMRL6_POSITION                           0x6
#define _TU16ATMRL_TMRL6_SIZE                               0x1
#define _TU16ATMRL_TMRL6_LENGTH                             0x1
#define _TU16ATMRL_TMRL6_MASK                               0x40
#define _TU16ATMRL_TMRL7_POSN                               0x7
#define _TU16ATMRL_TMRL7_POSITION                           0x7
#define _TU16ATMRL_TMRL7_SIZE                               0x1
#define _TU16ATMRL_TMRL7_LENGTH                             0x1
#define _TU16ATMRL_TMRL7_MASK                               0x80
#define _TU16ATMRL_TU16ATMRL0_POSN                          0x0
#define _TU16ATMRL_TU16ATMRL0_POSITION                      0x0
#define _TU16ATMRL_TU16ATMRL0_SIZE                          0x1
#define _TU16ATMRL_TU16ATMRL0_LENGTH                        0x1
#define _TU16ATMRL_TU16ATMRL0_MASK                          0x1
#define _TU16ATMRL_TU16ATMRL1_POSN                          0x1
#define _TU16ATMRL_TU16ATMRL1_POSITION                      0x1
#define _TU16ATMRL_TU16ATMRL1_SIZE                          0x1
#define _TU16ATMRL_TU16ATMRL1_LENGTH                        0x1
#define _TU16ATMRL_TU16ATMRL1_MASK                          0x2
#define _TU16ATMRL_TU16ATMRL2_POSN                          0x2
#define _TU16ATMRL_TU16ATMRL2_POSITION                      0x2
#define _TU16ATMRL_TU16ATMRL2_SIZE                          0x1
#define _TU16ATMRL_TU16ATMRL2_LENGTH                        0x1
#define _TU16ATMRL_TU16ATMRL2_MASK                          0x4
#define _TU16ATMRL_TU16ATMRL3_POSN                          0x3
#define _TU16ATMRL_TU16ATMRL3_POSITION                      0x3
#define _TU16ATMRL_TU16ATMRL3_SIZE                          0x1
#define _TU16ATMRL_TU16ATMRL3_LENGTH                        0x1
#define _TU16ATMRL_TU16ATMRL3_MASK                          0x8
#define _TU16ATMRL_TU16ATMRL4_POSN                          0x4
#define _TU16ATMRL_TU16ATMRL4_POSITION                      0x4
#define _TU16ATMRL_TU16ATMRL4_SIZE                          0x1
#define _TU16ATMRL_TU16ATMRL4_LENGTH                        0x1
#define _TU16ATMRL_TU16ATMRL4_MASK                          0x10
#define _TU16ATMRL_TU16ATMRL5_POSN                          0x5
#define _TU16ATMRL_TU16ATMRL5_POSITION                      0x5
#define _TU16ATMRL_TU16ATMRL5_SIZE                          0x1
#define _TU16ATMRL_TU16ATMRL5_LENGTH                        0x1
#define _TU16ATMRL_TU16ATMRL5_MASK                          0x20
#define _TU16ATMRL_TU16ATMRL6_POSN                          0x6
#define _TU16ATMRL_TU16ATMRL6_POSITION                      0x6
#define _TU16ATMRL_TU16ATMRL6_SIZE                          0x1
#define _TU16ATMRL_TU16ATMRL6_LENGTH                        0x1
#define _TU16ATMRL_TU16ATMRL6_MASK                          0x40
#define _TU16ATMRL_TU16ATMRL7_POSN                          0x7
#define _TU16ATMRL_TU16ATMRL7_POSITION                      0x7
#define _TU16ATMRL_TU16ATMRL7_SIZE                          0x1
#define _TU16ATMRL_TU16ATMRL7_LENGTH                        0x1
#define _TU16ATMRL_TU16ATMRL7_MASK                          0x80
#define _TU16ATMRL_TU16ATMR0_POSN                           0x0
#define _TU16ATMRL_TU16ATMR0_POSITION                       0x0
#define _TU16ATMRL_TU16ATMR0_SIZE                           0x1
#define _TU16ATMRL_TU16ATMR0_LENGTH                         0x1
#define _TU16ATMRL_TU16ATMR0_MASK                           0x1
#define _TU16ATMRL_TU16ATMR1_POSN                           0x1
#define _TU16ATMRL_TU16ATMR1_POSITION                       0x1
#define _TU16ATMRL_TU16ATMR1_SIZE                           0x1
#define _TU16ATMRL_TU16ATMR1_LENGTH                         0x1
#define _TU16ATMRL_TU16ATMR1_MASK                           0x2
#define _TU16ATMRL_TU16ATMR2_POSN                           0x2
#define _TU16ATMRL_TU16ATMR2_POSITION                       0x2
#define _TU16ATMRL_TU16ATMR2_SIZE                           0x1
#define _TU16ATMRL_TU16ATMR2_LENGTH                         0x1
#define _TU16ATMRL_TU16ATMR2_MASK                           0x4
#define _TU16ATMRL_TU16ATMR3_POSN                           0x3
#define _TU16ATMRL_TU16ATMR3_POSITION                       0x3
#define _TU16ATMRL_TU16ATMR3_SIZE                           0x1
#define _TU16ATMRL_TU16ATMR3_LENGTH                         0x1
#define _TU16ATMRL_TU16ATMR3_MASK                           0x8
#define _TU16ATMRL_TU16ATMR4_POSN                           0x4
#define _TU16ATMRL_TU16ATMR4_POSITION                       0x4
#define _TU16ATMRL_TU16ATMR4_SIZE                           0x1
#define _TU16ATMRL_TU16ATMR4_LENGTH                         0x1
#define _TU16ATMRL_TU16ATMR4_MASK                           0x10
#define _TU16ATMRL_TU16ATMR5_POSN                           0x5
#define _TU16ATMRL_TU16ATMR5_POSITION                       0x5
#define _TU16ATMRL_TU16ATMR5_SIZE                           0x1
#define _TU16ATMRL_TU16ATMR5_LENGTH                         0x1
#define _TU16ATMRL_TU16ATMR5_MASK                           0x20
#define _TU16ATMRL_TU16ATMR6_POSN                           0x6
#define _TU16ATMRL_TU16ATMR6_POSITION                       0x6
#define _TU16ATMRL_TU16ATMR6_SIZE                           0x1
#define _TU16ATMRL_TU16ATMR6_LENGTH                         0x1
#define _TU16ATMRL_TU16ATMR6_MASK                           0x40
#define _TU16ATMRL_TU16ATMR7_POSN                           0x7
#define _TU16ATMRL_TU16ATMR7_POSITION                       0x7
#define _TU16ATMRL_TU16ATMR7_SIZE                           0x1
#define _TU16ATMRL_TU16ATMR7_LENGTH                         0x1
#define _TU16ATMRL_TU16ATMR7_MASK                           0x80

// Register: TU16ACRL
#define TU16ACRL TU16ACRL
extern volatile unsigned char           TU16ACRL            __at(0x3A1);
#ifndef _LIB_BUILD
asm("TU16ACRL equ 03A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRL                    :8;
    };
    struct {
        unsigned CRL0                   :1;
        unsigned CRL1                   :1;
        unsigned CRL2                   :1;
        unsigned CRL3                   :1;
        unsigned CRL4                   :1;
        unsigned CRL5                   :1;
        unsigned CRL6                   :1;
        unsigned CRL7                   :1;
    };
    struct {
        unsigned TU16ACRL0              :1;
        unsigned TU16ACRL1              :1;
        unsigned TU16ACRL2              :1;
        unsigned TU16ACRL3              :1;
        unsigned TU16ACRL4              :1;
        unsigned TU16ACRL5              :1;
        unsigned TU16ACRL6              :1;
        unsigned TU16ACRL7              :1;
    };
    struct {
        unsigned TU16ACR0               :1;
        unsigned TU16ACR1               :1;
        unsigned TU16ACR2               :1;
        unsigned TU16ACR3               :1;
        unsigned TU16ACR4               :1;
        unsigned TU16ACR5               :1;
        unsigned TU16ACR6               :1;
        unsigned TU16ACR7               :1;
    };
} TU16ACRLbits_t;
