garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f46q24.h
#define                                 TU16BPR28_bit       _BIT_ACCESS(TU16BPRT,4)
// TU16BPRT<TU16BPR29>
extern volatile __bit                   TU16BPR29           __at(0x1DB5);	// @ (0x3B6 * 8 + 5)
#define                                 TU16BPR29_bit       _BIT_ACCESS(TU16BPRT,5)
// TU16BPRL<TU16BPR3>
extern volatile __bit                   TU16BPR3            __at(0x1D9B);	// @ (0x3B3 * 8 + 3)
#define                                 TU16BPR3_bit        _BIT_ACCESS(TU16BPRL,3)
// TU16BPRT<TU16BPR30>
extern volatile __bit                   TU16BPR30           __at(0x1DB6);	// @ (0x3B6 * 8 + 6)
#define                                 TU16BPR30_bit       _BIT_ACCESS(TU16BPRT,6)
// TU16BPRT<TU16BPR31>
extern volatile __bit                   TU16BPR31           __at(0x1DB7);	// @ (0x3B6 * 8 + 7)
#define                                 TU16BPR31_bit       _BIT_ACCESS(TU16BPRT,7)
// TU16BPRL<TU16BPR4>
extern volatile __bit                   TU16BPR4            __at(0x1D9C);	// @ (0x3B3 * 8 + 4)
#define                                 TU16BPR4_bit        _BIT_ACCESS(TU16BPRL,4)
// TU16BPRL<TU16BPR5>
extern volatile __bit                   TU16BPR5            __at(0x1D9D);	// @ (0x3B3 * 8 + 5)
#define                                 TU16BPR5_bit        _BIT_ACCESS(TU16BPRL,5)
// TU16BPRL<TU16BPR6>
extern volatile __bit                   TU16BPR6            __at(0x1D9E);	// @ (0x3B3 * 8 + 6)
#define                                 TU16BPR6_bit        _BIT_ACCESS(TU16BPRL,6)
// TU16BPRL<TU16BPR7>
extern volatile __bit                   TU16BPR7            __at(0x1D9F);	// @ (0x3B3 * 8 + 7)
#define                                 TU16BPR7_bit        _BIT_ACCESS(TU16BPRL,7)
// TU16BPRH<TU16BPR8>
extern volatile __bit                   TU16BPR8            __at(0x1DA0);	// @ (0x3B4 * 8 + 0)
#define                                 TU16BPR8_bit        _BIT_ACCESS(TU16BPRH,0)
// TU16BPRH<TU16BPR9>
extern volatile __bit                   TU16BPR9            __at(0x1DA1);	// @ (0x3B4 * 8 + 1)
#define                                 TU16BPR9_bit        _BIT_ACCESS(TU16BPRH,1)
// TU16BPRH<TU16BPRH0>
extern volatile __bit                   TU16BPRH0           __at(0x1DA0);	// @ (0x3B4 * 8 + 0)
#define                                 TU16BPRH0_bit       _BIT_ACCESS(TU16BPRH,0)
// TU16BPRH<TU16BPRH1>
extern volatile __bit                   TU16BPRH1           __at(0x1DA1);	// @ (0x3B4 * 8 + 1)
#define                                 TU16BPRH1_bit       _BIT_ACCESS(TU16BPRH,1)
// TU16BPRH<TU16BPRH2>
extern volatile __bit                   TU16BPRH2           __at(0x1DA2);	// @ (0x3B4 * 8 + 2)
#define                                 TU16BPRH2_bit       _BIT_ACCESS(TU16BPRH,2)
// TU16BPRH<TU16BPRH3>
extern volatile __bit                   TU16BPRH3           __at(0x1DA3);	// @ (0x3B4 * 8 + 3)
#define                                 TU16BPRH3_bit       _BIT_ACCESS(TU16BPRH,3)
// TU16BPRH<TU16BPRH4>
extern volatile __bit                   TU16BPRH4           __at(0x1DA4);	// @ (0x3B4 * 8 + 4)
#define                                 TU16BPRH4_bit       _BIT_ACCESS(TU16BPRH,4)
// TU16BPRH<TU16BPRH5>
extern volatile __bit                   TU16BPRH5           __at(0x1DA5);	// @ (0x3B4 * 8 + 5)
#define                                 TU16BPRH5_bit       _BIT_ACCESS(TU16BPRH,5)
// TU16BPRH<TU16BPRH6>
extern volatile __bit                   TU16BPRH6           __at(0x1DA6);	// @ (0x3B4 * 8 + 6)
#define                                 TU16BPRH6_bit       _BIT_ACCESS(TU16BPRH,6)
// TU16BPRH<TU16BPRH7>
extern volatile __bit                   TU16BPRH7           __at(0x1DA7);	// @ (0x3B4 * 8 + 7)
#define                                 TU16BPRH7_bit       _BIT_ACCESS(TU16BPRH,7)
// TU16BCON0<TU16BPRIE>
extern volatile __bit                   TU16BPRIE           __at(0x1D5A);	// @ (0x3AB * 8 + 2)
#define                                 TU16BPRIE_bit       _BIT_ACCESS(TU16BCON0,2)
// TU16BCON1<TU16BPRIF>
extern volatile __bit                   TU16BPRIF           __at(0x1D62);	// @ (0x3AC * 8 + 2)
#define                                 TU16BPRIF_bit       _BIT_ACCESS(TU16BCON1,2)
// TU16BPRL<TU16BPRL0>
extern volatile __bit                   TU16BPRL0           __at(0x1D98);	// @ (0x3B3 * 8 + 0)
#define                                 TU16BPRL0_bit       _BIT_ACCESS(TU16BPRL,0)
// TU16BPRL<TU16BPRL1>
extern volatile __bit                   TU16BPRL1           __at(0x1D99);	// @ (0x3B3 * 8 + 1)
#define                                 TU16BPRL1_bit       _BIT_ACCESS(TU16BPRL,1)
// TU16BPRL<TU16BPRL2>
extern volatile __bit                   TU16BPRL2           __at(0x1D9A);	// @ (0x3B3 * 8 + 2)
#define                                 TU16BPRL2_bit       _BIT_ACCESS(TU16BPRL,2)
// TU16BPRL<TU16BPRL3>
extern volatile __bit                   TU16BPRL3           __at(0x1D9B);	// @ (0x3B3 * 8 + 3)
#define                                 TU16BPRL3_bit       _BIT_ACCESS(TU16BPRL,3)
// TU16BPRL<TU16BPRL4>
extern volatile __bit                   TU16BPRL4           __at(0x1D9C);	// @ (0x3B3 * 8 + 4)
#define                                 TU16BPRL4_bit       _BIT_ACCESS(TU16BPRL,4)
// TU16BPRL<TU16BPRL5>
extern volatile __bit                   TU16BPRL5           __at(0x1D9D);	// @ (0x3B3 * 8 + 5)
#define                                 TU16BPRL5_bit       _BIT_ACCESS(TU16BPRL,5)
// TU16BPRL<TU16BPRL6>
extern volatile __bit                   TU16BPRL6           __at(0x1D9E);	// @ (0x3B3 * 8 + 6)
#define                                 TU16BPRL6_bit       _BIT_ACCESS(TU16BPRL,6)
// TU16BPRL<TU16BPRL7>
extern volatile __bit                   TU16BPRL7           __at(0x1D9F);	// @ (0x3B3 * 8 + 7)
#define                                 TU16BPRL7_bit       _BIT_ACCESS(TU16BPRL,7)
// TU16BPRT<TU16BPRT0>
extern volatile __bit                   TU16BPRT0           __at(0x1DB0);	// @ (0x3B6 * 8 + 0)
#define                                 TU16BPRT0_bit       _BIT_ACCESS(TU16BPRT,0)
// TU16BPRT<TU16BPRT1>
extern volatile __bit                   TU16BPRT1           __at(0x1DB1);	// @ (0x3B6 * 8 + 1)
#define                                 TU16BPRT1_bit       _BIT_ACCESS(TU16BPRT,1)
// TU16BPRT<TU16BPRT2>
extern volatile __bit                   TU16BPRT2           __at(0x1DB2);	// @ (0x3B6 * 8 + 2)
#define                                 TU16BPRT2_bit       _BIT_ACCESS(TU16BPRT,2)
// TU16BPRT<TU16BPRT3>
extern volatile __bit                   TU16BPRT3           __at(0x1DB3);	// @ (0x3B6 * 8 + 3)
#define                                 TU16BPRT3_bit       _BIT_ACCESS(TU16BPRT,3)
// TU16BPRT<TU16BPRT4>
extern volatile __bit                   TU16BPRT4           __at(0x1DB4);	// @ (0x3B6 * 8 + 4)
#define                                 TU16BPRT4_bit       _BIT_ACCESS(TU16BPRT,4)
// TU16BPRT<TU16BPRT5>
extern volatile __bit                   TU16BPRT5           __at(0x1DB5);	// @ (0x3B6 * 8 + 5)
#define                                 TU16BPRT5_bit       _BIT_ACCESS(TU16BPRT,5)
// TU16BPRT<TU16BPRT6>
extern volatile __bit                   TU16BPRT6           __at(0x1DB6);	// @ (0x3B6 * 8 + 6)
#define                                 TU16BPRT6_bit       _BIT_ACCESS(TU16BPRT,6)
// TU16BPRT<TU16BPRT7>
extern volatile __bit                   TU16BPRT7           __at(0x1DB7);	// @ (0x3B6 * 8 + 7)
#define                                 TU16BPRT7_bit       _BIT_ACCESS(TU16BPRT,7)
// TU16BPS<TU16BPS0>
extern volatile __bit                   TU16BPS0            __at(0x1D70);	// @ (0x3AE * 8 + 0)
#define                                 TU16BPS0_bit        _BIT_ACCESS(TU16BPS,0)
// TU16BPS<TU16BPS1>
extern volatile __bit                   TU16BPS1            __at(0x1D71);	// @ (0x3AE * 8 + 1)
#define                                 TU16BPS1_bit        _BIT_ACCESS(TU16BPS,1)
// TU16BPS<TU16BPS2>
extern volatile __bit                   TU16BPS2            __at(0x1D72);	// @ (0x3AE * 8 + 2)
#define                                 TU16BPS2_bit        _BIT_ACCESS(TU16BPS,2)
// TU16BPS<TU16BPS3>
extern volatile __bit                   TU16BPS3            __at(0x1D73);	// @ (0x3AE * 8 + 3)
#define                                 TU16BPS3_bit        _BIT_ACCESS(TU16BPS,3)
// TU16BPS<TU16BPS4>
extern volatile __bit                   TU16BPS4            __at(0x1D74);	// @ (0x3AE * 8 + 4)
#define                                 TU16BPS4_bit        _BIT_ACCESS(TU16BPS,4)
// TU16BPS<TU16BPS5>
extern volatile __bit                   TU16BPS5            __at(0x1D75);	// @ (0x3AE * 8 + 5)
#define                                 TU16BPS5_bit        _BIT_ACCESS(TU16BPS,5)
// TU16BPS<TU16BPS6>
extern volatile __bit                   TU16BPS6            __at(0x1D76);	// @ (0x3AE * 8 + 6)
#define                                 TU16BPS6_bit        _BIT_ACCESS(TU16BPS,6)
// TU16BPS<TU16BPS7>
extern volatile __bit                   TU16BPS7            __at(0x1D77);	// @ (0x3AE * 8 + 7)
#define                                 TU16BPS7_bit        _BIT_ACCESS(TU16BPS,7)
// TU16BCON0<TU16BRDSEL>
extern volatile __bit                   TU16BRDSEL          __at(0x1D5B);	// @ (0x3AB * 8 + 3)
#define                                 TU16BRDSEL_bit      _BIT_ACCESS(TU16BCON0,3)
// TU16BHLT<TU16BRESET0>
extern volatile __bit                   TU16BRESET0         __at(0x1D6A);	// @ (0x3AD * 8 + 2)
#define                                 TU16BRESET0_bit     _BIT_ACCESS(TU16BHLT,2)
// TU16BHLT<TU16BRESET1>
extern volatile __bit                   TU16BRESET1         __at(0x1D6B);	// @ (0x3AD * 8 + 3)
#define                                 TU16BRESET1_bit     _BIT_ACCESS(TU16BHLT,3)
// TU16BCON1<TU16BRUN>
extern volatile __bit                   TU16BRUN            __at(0x1D67);	// @ (0x3AC * 8 + 7)
#define                                 TU16BRUN_bit        _BIT_ACCESS(TU16BCON1,7)
// TU16BHLT<TU16BSTART0>
extern volatile __bit                   TU16BSTART0         __at(0x1D6C);	// @ (0x3AD * 8 + 4)
#define                                 TU16BSTART0_bit     _BIT_ACCESS(TU16BHLT,4)
// TU16BHLT<TU16BSTART1>
extern volatile __bit                   TU16BSTART1         __at(0x1D6D);	// @ (0x3AD * 8 + 5)
#define                                 TU16BSTART1_bit     _BIT_ACCESS(TU16BHLT,5)
// TU16BHLT<TU16BSTOP0>
extern volatile __bit                   TU16BSTOP0          __at(0x1D68);	// @ (0x3AD * 8 + 0)
#define                                 TU16BSTOP0_bit      _BIT_ACCESS(TU16BHLT,0)
// TU16BHLT<TU16BSTOP1>
extern volatile __bit                   TU16BSTOP1          __at(0x1D69);	// @ (0x3AD * 8 + 1)
#define                                 TU16BSTOP1_bit      _BIT_ACCESS(TU16BHLT,1)
// TU16BTMRL<TU16BTMR0>
extern volatile __bit                   TU16BTMR0           __at(0x1D78);	// @ (0x3AF * 8 + 0)
#define                                 TU16BTMR0_bit       _BIT_ACCESS(TU16BTMRL,0)
// TU16BTMRL<TU16BTMR1>
extern volatile __bit                   TU16BTMR1           __at(0x1D79);	// @ (0x3AF * 8 + 1)
#define                                 TU16BTMR1_bit       _BIT_ACCESS(TU16BTMRL,1)
// TU16BTMRH<TU16BTMR10>
extern volatile __bit                   TU16BTMR10          __at(0x1D82);	// @ (0x3B0 * 8 + 2)
#define                                 TU16BTMR10_bit      _BIT_ACCESS(TU16BTMRH,2)
// TU16BTMRH<TU16BTMR11>
extern volatile __bit                   TU16BTMR11          __at(0x1D83);	// @ (0x3B0 * 8 + 3)
#define                                 TU16BTMR11_bit      _BIT_ACCESS(TU16BTMRH,3)
// TU16BTMRH<TU16BTMR12>
extern volatile __bit                   TU16BTMR12          __at(0x1D84);	// @ (0x3B0 * 8 + 4)
#define                                 TU16BTMR12_bit      _BIT_ACCESS(TU16BTMRH,4)
// TU16BTMRH<TU16BTMR13>
extern volatile __bit                   TU16BTMR13          __at(0x1D85);	// @ (0x3B0 * 8 + 5)
#define                                 TU16BTMR13_bit      _BIT_ACCESS(TU16BTMRH,5)
// TU16BTMRH<TU16BTMR14>
extern volatile __bit                   TU16BTMR14          __at(0x1D86);	// @ (0x3B0 * 8 + 6)
#define                                 TU16BTMR14_bit      _BIT_ACCESS(TU16BTMRH,6)
// TU16BTMRH<TU16BTMR15>
extern volatile __bit                   TU16BTMR15          __at(0x1D87);	// @ (0x3B0 * 8 + 7)
#define                                 TU16BTMR15_bit      _BIT_ACCESS(TU16BTMRH,7)
// TU16BTMRL<TU16BTMR2>
extern volatile __bit                   TU16BTMR2           __at(0x1D7A);	// @ (0x3AF * 8 + 2)
#define                                 TU16BTMR2_bit       _BIT_ACCESS(TU16BTMRL,2)
// TU16BTMRT<TU16BTMR24>
extern volatile __bit                   TU16BTMR24          __at(0x1D90);	// @ (0x3B2 * 8 + 0)
#define                                 TU16BTMR24_bit      _BIT_ACCESS(TU16BTMRT,0)
// TU16BTMRT<TU16BTMR25>
extern volatile __bit                   TU16BTMR25          __at(0x1D91);	// @ (0x3B2 * 8 + 1)
#define                                 TU16BTMR25_bit      _BIT_ACCESS(TU16BTMRT,1)
// TU16BTMRT<TU16BTMR26>
extern volatile __bit                   TU16BTMR26          __at(0x1D92);	// @ (0x3B2 * 8 + 2)
#define                                 TU16BTMR26_bit      _BIT_ACCESS(TU16BTMRT,2)
// TU16BTMRT<TU16BTMR27>
extern volatile __bit                   TU16BTMR27          __at(0x1D93);	// @ (0x3B2 * 8 + 3)
#define                                 TU16BTMR27_bit      _BIT_ACCESS(TU16BTMRT,3)
// TU16BTMRT<TU16BTMR28>
extern volatile __bit                   TU16BTMR28          __at(0x1D94);	// @ (0x3B2 * 8 + 4)
#define                                 TU16BTMR28_bit      _BIT_ACCESS(TU16BTMRT,4)
// TU16BTMRT<TU16BTMR29>
extern volatile __bit                   TU16BTMR29          __at(0x1D95);	// @ (0x3B2 * 8 + 5)
#define                                 TU16BTMR29_bit      _BIT_ACCESS(TU16BTMRT,5)
// TU16BTMRL<TU16BTMR3>
extern volatile __bit                   TU16BTMR3           __at(0x1D7B);	// @ (0x3AF * 8 + 3)
#define                                 TU16BTMR3_bit       _BIT_ACCESS(TU16BTMRL,3)
// TU16BTMRT<TU16BTMR30>
extern volatile __bit                   TU16BTMR30          __at(0x1D96);	// @ (0x3B2 * 8 + 6)
#define                                 TU16BTMR30_bit      _BIT_ACCESS(TU16BTMRT,6)
// TU16BTMRT<TU16BTMR31>
extern volatile __bit                   TU16BTMR31          __at(0x1D97);	// @ (0x3B2 * 8 + 7)
#define                                 TU16BTMR31_bit      _BIT_ACCESS(TU16BTMRT,7)
// TU16BTMRL<TU16BTMR4>
extern volatile __bit                   TU16BTMR4           __at(0x1D7C);	// @ (0x3AF * 8 + 4)
#define                                 TU16BTMR4_bit       _BIT_ACCESS(TU16BTMRL,4)
// TU16BTMRL<TU16BTMR5>
extern volatile __bit                   TU16BTMR5           __at(0x1D7D);	// @ (0x3AF * 8 + 5)
#define                                 TU16BTMR5_bit       _BIT_ACCESS(TU16BTMRL,5)
// TU16BTMRL<TU16BTMR6>
extern volatile __bit                   TU16BTMR6           __at(0x1D7E);	// @ (0x3AF * 8 + 6)
#define                                 TU16BTMR6_bit       _BIT_ACCESS(TU16BTMRL,6)
// TU16BTMRL<TU16BTMR7>
extern volatile __bit                   TU16BTMR7           __at(0x1D7F);	// @ (0x3AF * 8 + 7)
#define                                 TU16BTMR7_bit       _BIT_ACCESS(TU16BTMRL,7)
// TU16BTMRH<TU16BTMR8>
extern volatile __bit                   TU16BTMR8           __at(0x1D80);	// @ (0x3B0 * 8 + 0)
#define                                 TU16BTMR8_bit       _BIT_ACCESS(TU16BTMRH,0)
// TU16BTMRH<TU16BTMR9>
extern volatile __bit                   TU16BTMR9           __at(0x1D81);	// @ (0x3B0 * 8 + 1)
#define                                 TU16BTMR9_bit       _BIT_ACCESS(TU16BTMRH,1)
// TU16BTMRH<TU16BTMRH0>
extern volatile __bit                   TU16BTMRH0          __at(0x1D80);	// @ (0x3B0 * 8 + 0)
#define                                 TU16BTMRH0_bit      _BIT_ACCESS(TU16BTMRH,0)
// TU16BTMRH<TU16BTMRH1>
extern volatile __bit                   TU16BTMRH1          __at(0x1D81);	// @ (0x3B0 * 8 + 1)
#define                                 TU16BTMRH1_bit      _BIT_ACCESS(TU16BTMRH,1)
// TU16BTMRH<TU16BTMRH2>
extern volatile __bit                   TU16BTMRH2          __at(0x1D82);	// @ (0x3B0 * 8 + 2)
#define                                 TU16BTMRH2_bit      _BIT_ACCESS(TU16BTMRH,2)
// TU16BTMRH<TU16BTMRH3>
extern volatile __bit                   TU16BTMRH3          __at(0x1D83);	// @ (0x3B0 * 8 + 3)
#define                                 TU16BTMRH3_bit      _BIT_ACCESS(TU16BTMRH,3)
// TU16BTMRH<TU16BTMRH4>
extern volatile __bit                   TU16BTMRH4          __at(0x1D84);	// @ (0x3B0 * 8 + 4)
#define                                 TU16BTMRH4_bit      _BIT_ACCESS(TU16BTMRH,4)
// TU16BTMRH<TU16BTMRH5>
extern volatile __bit                   TU16BTMRH5          __at(0x1D85);	// @ (0x3B0 * 8 + 5)
#define                                 TU16BTMRH5_bit      _BIT_ACCESS(TU16BTMRH,5)
// TU16BTMRH<TU16BTMRH6>
extern volatile __bit                   TU16BTMRH6          __at(0x1D86);	// @ (0x3B0 * 8 + 6)
#define                                 TU16BTMRH6_bit      _BIT_ACCESS(TU16BTMRH,6)
// TU16BTMRH<TU16BTMRH7>
extern volatile __bit                   TU16BTMRH7          __at(0x1D87);	// @ (0x3B0 * 8 + 7)
#define                                 TU16BTMRH7_bit      _BIT_ACCESS(TU16BTMRH,7)
// TU16BTMRL<TU16BTMRL0>
extern volatile __bit                   TU16BTMRL0          __at(0x1D78);	// @ (0x3AF * 8 + 0)
#define                                 TU16BTMRL0_bit      _BIT_ACCESS(TU16BTMRL,0)
// TU16BTMRL<TU16BTMRL1>
extern volatile __bit                   TU16BTMRL1          __at(0x1D79);	// @ (0x3AF * 8 + 1)
#define                                 TU16BTMRL1_bit      _BIT_ACCESS(TU16BTMRL,1)
// TU16BTMRL<TU16BTMRL2>
extern volatile __bit                   TU16BTMRL2          __at(0x1D7A);	// @ (0x3AF * 8 + 2)
#define                                 TU16BTMRL2_bit      _BIT_ACCESS(TU16BTMRL,2)
// TU16BTMRL<TU16BTMRL3>
extern volatile __bit                   TU16BTMRL3          __at(0x1D7B);	// @ (0x3AF * 8 + 3)
#define                                 TU16BTMRL3_bit      _BIT_ACCESS(TU16BTMRL,3)
// TU16BTMRL<TU16BTMRL4>
extern volatile __bit                   TU16BTMRL4          __at(0x1D7C);	// @ (0x3AF * 8 + 4)
#define                                 TU16BTMRL4_bit      _BIT_ACCESS(TU16BTMRL,4)
// TU16BTMRL<TU16BTMRL5>
extern volatile __bit                   TU16BTMRL5          __at(0x1D7D);	// @ (0x3AF * 8 + 5)
#define                                 TU16BTMRL5_bit      _BIT_ACCESS(TU16BTMRL,5)
// TU16BTMRL<TU16BTMRL6>
extern volatile __bit                   TU16BTMRL6          __at(0x1D7E);	// @ (0x3AF * 8 + 6)
#define                                 TU16BTMRL6_bit      _BIT_ACCESS(TU16BTMRL,6)
// TU16BTMRL<TU16BTMRL7>
extern volatile __bit                   TU16BTMRL7          __at(0x1D7F);	// @ (0x3AF * 8 + 7)
#define                                 TU16BTMRL7_bit      _BIT_ACCESS(TU16BTMRL,7)
// TU16BTMRT<TU16BTMRT0>
extern volatile __bit                   TU16BTMRT0          __at(0x1D90);	// @ (0x3B2 * 8 + 0)
#define                                 TU16BTMRT0_bit      _BIT_ACCESS(TU16BTMRT,0)
// TU16BTMRT<TU16BTMRT1>
extern volatile __bit                   TU16BTMRT1          __at(0x1D91);	// @ (0x3B2 * 8 + 1)
#define                                 TU16BTMRT1_bit      _BIT_ACCESS(TU16BTMRT,1)
// TU16BTMRT<TU16BTMRT2>
extern volatile __bit                   TU16BTMRT2          __at(0x1D92);	// @ (0x3B2 * 8 + 2)
#define                                 TU16BTMRT2_bit      _BIT_ACCESS(TU16BTMRT,2)
// TU16BTMRT<TU16BTMRT3>
extern volatile __bit                   TU16BTMRT3          __at(0x1D93);	// @ (0x3B2 * 8 + 3)
#define                                 TU16BTMRT3_bit      _BIT_ACCESS(TU16BTMRT,3)
// TU16BTMRT<TU16BTMRT4>
extern volatile __bit                   TU16BTMRT4          __at(0x1D94);	// @ (0x3B2 * 8 + 4)
#define                                 TU16BTMRT4_bit      _BIT_ACCESS(TU16BTMRT,4)
// TU16BTMRT<TU16BTMRT5>
extern volatile __bit                   TU16BTMRT5          __at(0x1D95);	// @ (0x3B2 * 8 + 5)
#define                                 TU16BTMRT5_bit      _BIT_ACCESS(TU16BTMRT,5)
// TU16BTMRT<TU16BTMRT6>
extern volatile __bit                   TU16BTMRT6          __at(0x1D96);	// @ (0x3B2 * 8 + 6)
#define                                 TU16BTMRT6_bit      _BIT_ACCESS(TU16BTMRT,6)
// TU16BTMRT<TU16BTMRT7>
extern volatile __bit                   TU16BTMRT7          __at(0x1D97);	// @ (0x3B2 * 8 + 7)
#define                                 TU16BTMRT7_bit      _BIT_ACCESS(TU16BTMRT,7)
// TU16BCON0<TU16BZIE>
extern volatile __bit                   TU16BZIE            __at(0x1D59);	// @ (0x3AB * 8 + 1)
#define                                 TU16BZIE_bit        _BIT_ACCESS(TU16BCON0,1)
// TU16BCON1<TU16BZIF>
extern volatile __bit                   TU16BZIF            __at(0x1D61);	// @ (0x3AC * 8 + 1)
#define                                 TU16BZIF_bit        _BIT_ACCESS(TU16BCON1,1)
// TUIN0PPS<TUIN0PPS0>
extern volatile __bit                   TUIN0PPS0           __at(0x13C0);	// @ (0x278 * 8 + 0)
#define                                 TUIN0PPS0_bit       _BIT_ACCESS(TUIN0PPS,0)
// TUIN0PPS<TUIN0PPS1>
extern volatile __bit                   TUIN0PPS1           __at(0x13C1);	// @ (0x278 * 8 + 1)
#define                                 TUIN0PPS1_bit       _BIT_ACCESS(TUIN0PPS,1)
// TUIN0PPS<TUIN0PPS2>
extern volatile __bit                   TUIN0PPS2           __at(0x13C2);	// @ (0x278 * 8 + 2)
#define                                 TUIN0PPS2_bit       _BIT_ACCESS(TUIN0PPS,2)
// TUIN0PPS<TUIN0PPS3>
extern volatile __bit                   TUIN0PPS3           __at(0x13C3);	// @ (0x278 * 8 + 3)
#define                                 TUIN0PPS3_bit       _BIT_ACCESS(TUIN0PPS,3)
// TUIN0PPS<TUIN0PPS4>
extern volatile __bit                   TUIN0PPS4           __at(0x13C4);	// @ (0x278 * 8 + 4)
#define                                 TUIN0PPS4_bit       _BIT_ACCESS(TUIN0PPS,4)
// TUIN0PPS<TUIN0PPS5>
extern volatile __bit                   TUIN0PPS5           __at(0x13C5);	// @ (0x278 * 8 + 5)
#define                                 TUIN0PPS5_bit       _BIT_ACCESS(TUIN0PPS,5)
// TUIN1PPS<TUIN1PPS0>
extern volatile __bit                   TUIN1PPS0           __at(0x13C8);	// @ (0x279 * 8 + 0)
#define                                 TUIN1PPS0_bit       _BIT_ACCESS(TUIN1PPS,0)
// TUIN1PPS<TUIN1PPS1>
extern volatile __bit                   TUIN1PPS1           __at(0x13C9);	// @ (0x279 * 8 + 1)
#define                                 TUIN1PPS1_bit       _BIT_ACCESS(TUIN1PPS,1)
// TUIN1PPS<TUIN1PPS2>
extern volatile __bit                   TUIN1PPS2           __at(0x13CA);	// @ (0x279 * 8 + 2)
#define                                 TUIN1PPS2_bit       _BIT_ACCESS(TUIN1PPS,2)
// TUIN1PPS<TUIN1PPS3>
extern volatile __bit                   TUIN1PPS3           __at(0x13CB);	// @ (0x279 * 8 + 3)
#define                                 TUIN1PPS3_bit       _BIT_ACCESS(TUIN1PPS,3)
// TUIN1PPS<TUIN1PPS4>
extern volatile __bit                   TUIN1PPS4           __at(0x13CC);	// @ (0x279 * 8 + 4)
#define                                 TUIN1PPS4_bit       _BIT_ACCESS(TUIN1PPS,4)
// TUIN1PPS<TUIN1PPS5>
extern volatile __bit                   TUIN1PPS5           __at(0x13CD);	// @ (0x279 * 8 + 5)
#define                                 TUIN1PPS5_bit       _BIT_ACCESS(TUIN1PPS,5)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x580);	// @ (0xB0 * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x581);	// @ (0xB0 * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x582);	// @ (0xB0 * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x583);	// @ (0xB0 * 8 + 3)
