garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f46q24.h
#define                                 XOR13_bit           _BIT_ACCESS(CRCXORH,5)
// CRCXORH<XOR14>
extern volatile __bit                   XOR14               __at(0x1A9E);	// @ (0x353 * 8 + 6)
#define                                 XOR14_bit           _BIT_ACCESS(CRCXORH,6)
// CRCXORH<XOR15>
extern volatile __bit                   XOR15               __at(0x1A9F);	// @ (0x353 * 8 + 7)
#define                                 XOR15_bit           _BIT_ACCESS(CRCXORH,7)
// CRCXORU<XOR16>
extern volatile __bit                   XOR16               __at(0x1AA0);	// @ (0x354 * 8 + 0)
#define                                 XOR16_bit           _BIT_ACCESS(CRCXORU,0)
// CRCXORU<XOR17>
extern volatile __bit                   XOR17               __at(0x1AA1);	// @ (0x354 * 8 + 1)
#define                                 XOR17_bit           _BIT_ACCESS(CRCXORU,1)
// CRCXORU<XOR18>
extern volatile __bit                   XOR18               __at(0x1AA2);	// @ (0x354 * 8 + 2)
#define                                 XOR18_bit           _BIT_ACCESS(CRCXORU,2)
// CRCXORU<XOR19>
extern volatile __bit                   XOR19               __at(0x1AA3);	// @ (0x354 * 8 + 3)
#define                                 XOR19_bit           _BIT_ACCESS(CRCXORU,3)
// CRCXORL<XOR2>
extern volatile __bit                   XOR2                __at(0x1A92);	// @ (0x352 * 8 + 2)
#define                                 XOR2_bit            _BIT_ACCESS(CRCXORL,2)
// CRCXORU<XOR20>
extern volatile __bit                   XOR20               __at(0x1AA4);	// @ (0x354 * 8 + 4)
#define                                 XOR20_bit           _BIT_ACCESS(CRCXORU,4)
// CRCXORU<XOR21>
extern volatile __bit                   XOR21               __at(0x1AA5);	// @ (0x354 * 8 + 5)
#define                                 XOR21_bit           _BIT_ACCESS(CRCXORU,5)
// CRCXORU<XOR22>
extern volatile __bit                   XOR22               __at(0x1AA6);	// @ (0x354 * 8 + 6)
#define                                 XOR22_bit           _BIT_ACCESS(CRCXORU,6)
// CRCXORU<XOR23>
extern volatile __bit                   XOR23               __at(0x1AA7);	// @ (0x354 * 8 + 7)
#define                                 XOR23_bit           _BIT_ACCESS(CRCXORU,7)
// CRCXORT<XOR24>
extern volatile __bit                   XOR24               __at(0x1AA8);	// @ (0x355 * 8 + 0)
#define                                 XOR24_bit           _BIT_ACCESS(CRCXORT,0)
// CRCXORT<XOR25>
extern volatile __bit                   XOR25               __at(0x1AA9);	// @ (0x355 * 8 + 1)
#define                                 XOR25_bit           _BIT_ACCESS(CRCXORT,1)
// CRCXORT<XOR26>
extern volatile __bit                   XOR26               __at(0x1AAA);	// @ (0x355 * 8 + 2)
#define                                 XOR26_bit           _BIT_ACCESS(CRCXORT,2)
// CRCXORT<XOR27>
extern volatile __bit                   XOR27               __at(0x1AAB);	// @ (0x355 * 8 + 3)
#define                                 XOR27_bit           _BIT_ACCESS(CRCXORT,3)
// CRCXORT<XOR28>
extern volatile __bit                   XOR28               __at(0x1AAC);	// @ (0x355 * 8 + 4)
#define                                 XOR28_bit           _BIT_ACCESS(CRCXORT,4)
// CRCXORT<XOR29>
extern volatile __bit                   XOR29               __at(0x1AAD);	// @ (0x355 * 8 + 5)
#define                                 XOR29_bit           _BIT_ACCESS(CRCXORT,5)
// CRCXORL<XOR3>
extern volatile __bit                   XOR3                __at(0x1A93);	// @ (0x352 * 8 + 3)
#define                                 XOR3_bit            _BIT_ACCESS(CRCXORL,3)
// CRCXORT<XOR30>
extern volatile __bit                   XOR30               __at(0x1AAE);	// @ (0x355 * 8 + 6)
#define                                 XOR30_bit           _BIT_ACCESS(CRCXORT,6)
// CRCXORT<XOR31>
extern volatile __bit                   XOR31               __at(0x1AAF);	// @ (0x355 * 8 + 7)
#define                                 XOR31_bit           _BIT_ACCESS(CRCXORT,7)
// CRCXORL<XOR4>
extern volatile __bit                   XOR4                __at(0x1A94);	// @ (0x352 * 8 + 4)
#define                                 XOR4_bit            _BIT_ACCESS(CRCXORL,4)
// CRCXORL<XOR5>
extern volatile __bit                   XOR5                __at(0x1A95);	// @ (0x352 * 8 + 5)
#define                                 XOR5_bit            _BIT_ACCESS(CRCXORL,5)
// CRCXORL<XOR6>
extern volatile __bit                   XOR6                __at(0x1A96);	// @ (0x352 * 8 + 6)
#define                                 XOR6_bit            _BIT_ACCESS(CRCXORL,6)
// CRCXORL<XOR7>
extern volatile __bit                   XOR7                __at(0x1A97);	// @ (0x352 * 8 + 7)
#define                                 XOR7_bit            _BIT_ACCESS(CRCXORL,7)
// CRCXORH<XOR8>
extern volatile __bit                   XOR8                __at(0x1A98);	// @ (0x353 * 8 + 0)
#define                                 XOR8_bit            _BIT_ACCESS(CRCXORH,0)
// CRCXORH<XOR9>
extern volatile __bit                   XOR9                __at(0x1A99);	// @ (0x353 * 8 + 1)
#define                                 XOR9_bit            _BIT_ACCESS(CRCXORH,1)
// ZCD1CON<ZCD1EN>
extern volatile __bit                   ZCD1EN              __at(0x267);	// @ (0x4C * 8 + 7)
#define                                 ZCD1EN_bit          _BIT_ACCESS(ZCD1CON,7)
// PIE2<ZCD1IE>
extern volatile __bit                   ZCD1IE              __at(0x2563);	// @ (0x4AC * 8 + 3)
#define                                 ZCD1IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<ZCD1IF>
extern volatile __bit                   ZCD1IF              __at(0x25C3);	// @ (0x4B8 * 8 + 3)
#define                                 ZCD1IF_bit          _BIT_ACCESS(PIR2,3)
// ZCD1CON<ZCD1INTN>
extern volatile __bit                   ZCD1INTN            __at(0x260);	// @ (0x4C * 8 + 0)
#define                                 ZCD1INTN_bit        _BIT_ACCESS(ZCD1CON,0)
// ZCD1CON<ZCD1INTP>
extern volatile __bit                   ZCD1INTP            __at(0x261);	// @ (0x4C * 8 + 1)
#define                                 ZCD1INTP_bit        _BIT_ACCESS(ZCD1CON,1)
// IPR2<ZCD1IP>
extern volatile __bit                   ZCD1IP              __at(0x2503);	// @ (0x4A0 * 8 + 3)
#define                                 ZCD1IP_bit          _BIT_ACCESS(IPR2,3)
// PMD1<ZCD1MD>
extern volatile __bit                   ZCD1MD              __at(0x31E);	// @ (0x63 * 8 + 6)
#define                                 ZCD1MD_bit          _BIT_ACCESS(PMD1,6)
// ZCD1CON<ZCD1OUT>
extern volatile __bit                   ZCD1OUT             __at(0x265);	// @ (0x4C * 8 + 5)
#define                                 ZCD1OUT_bit         _BIT_ACCESS(ZCD1CON,5)
// ZCD1CON<ZCD1POL>
extern volatile __bit                   ZCD1POL             __at(0x264);	// @ (0x4C * 8 + 4)
#define                                 ZCD1POL_bit         _BIT_ACCESS(ZCD1CON,4)
// ZCD2CON<ZCD2EN>
extern volatile __bit                   ZCD2EN              __at(0x26F);	// @ (0x4D * 8 + 7)
#define                                 ZCD2EN_bit          _BIT_ACCESS(ZCD2CON,7)
// PIE2<ZCD2IE>
extern volatile __bit                   ZCD2IE              __at(0x2560);	// @ (0x4AC * 8 + 0)
#define                                 ZCD2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<ZCD2IF>
extern volatile __bit                   ZCD2IF              __at(0x25C0);	// @ (0x4B8 * 8 + 0)
#define                                 ZCD2IF_bit          _BIT_ACCESS(PIR2,0)
// ZCD2CON<ZCD2INTN>
extern volatile __bit                   ZCD2INTN            __at(0x268);	// @ (0x4D * 8 + 0)
#define                                 ZCD2INTN_bit        _BIT_ACCESS(ZCD2CON,0)
// ZCD2CON<ZCD2INTP>
extern volatile __bit                   ZCD2INTP            __at(0x269);	// @ (0x4D * 8 + 1)
#define                                 ZCD2INTP_bit        _BIT_ACCESS(ZCD2CON,1)
// IPR2<ZCD2IP>
extern volatile __bit                   ZCD2IP              __at(0x2500);	// @ (0x4A0 * 8 + 0)
#define                                 ZCD2IP_bit          _BIT_ACCESS(IPR2,0)
// PMD5<ZCD2MD>
extern volatile __bit                   ZCD2MD              __at(0x338);	// @ (0x67 * 8 + 0)
#define                                 ZCD2MD_bit          _BIT_ACCESS(PMD5,0)
// ZCD2CON<ZCD2OUT>
extern volatile __bit                   ZCD2OUT             __at(0x26D);	// @ (0x4D * 8 + 5)
#define                                 ZCD2OUT_bit         _BIT_ACCESS(ZCD2CON,5)
// ZCD2CON<ZCD2POL>
extern volatile __bit                   ZCD2POL             __at(0x26C);	// @ (0x4D * 8 + 4)
#define                                 ZCD2POL_bit         _BIT_ACCESS(ZCD2CON,4)
// PCON0<nBOR>
extern volatile __bit                   nBOR                __at(0x2780);	// @ (0x4F0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON0,0)
// NVMCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x200);	// @ (0x40 * 8 + 0)
#define                                 nDONE_bit           _BIT_ACCESS(NVMCON0,0)
// VDDIO2CON<nHYS>
extern volatile __bit                   nHYS                __at(0x86C);	// @ (0x10D * 8 + 4)
#define                                 nHYS_bit            _BIT_ACCESS(VDDIO2CON,4)
// VDDIO2CON<nIOMON>
extern volatile __bit                   nIOMON              __at(0x86F);	// @ (0x10D * 8 + 7)
#define                                 nIOMON_bit          _BIT_ACCESS(VDDIO2CON,7)
// PCON1<nMEMV>
extern volatile __bit                   nMEMV               __at(0x2789);	// @ (0x4F1 * 8 + 1)
#define                                 nMEMV_bit           _BIT_ACCESS(PCON1,1)
// PCON0<nPOR>
extern volatile __bit                   nPOR                __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON0,1)
// PCON1<nRCM>
extern volatile __bit                   nRCM                __at(0x2788);	// @ (0x4F1 * 8 + 0)
#define                                 nRCM_bit            _BIT_ACCESS(PCON1,0)
// PCON0<nRI>
extern volatile __bit                   nRI                 __at(0x2782);	// @ (0x4F0 * 8 + 2)
#define                                 nRI_bit             _BIT_ACCESS(PCON0,2)
// PCON0<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0x2783);	// @ (0x4F0 * 8 + 3)
#define                                 nRMCLR_bit          _BIT_ACCESS(PCON0,3)
// PCON1<nRVREG>
extern volatile __bit                   nRVREG              __at(0x278A);	// @ (0x4F1 * 8 + 2)
#define                                 nRVREG_bit          _BIT_ACCESS(PCON1,2)
// PCON0<nRWDT>
extern volatile __bit                   nRWDT               __at(0x2784);	// @ (0x4F0 * 8 + 4)
#define                                 nRWDT_bit           _BIT_ACCESS(PCON0,4)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x18A2);	// @ (0x314 * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x192A);	// @ (0x325 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// PCON0<nWDTWV>
extern volatile __bit                   nWDTWV              __at(0x2785);	// @ (0x4F0 * 8 + 5)
#define                                 nWDTWV_bit          _BIT_ACCESS(PCON0,5)

#endif // _PIC18F46Q24_H_
